[MainMissions.M_DLC4_TripWIRED MissionDefinition]
MissionDescription="The enigmatically named wireless WIRED device is the key to shutting down the Claptrap Revolution once and for all. Lower the bridge, storm Scorched Snake Canyon, and retrieve the device for Blake."
MissionGiver="Blake"
MissionName="Operation Trap Claptrap Trap, Phase Three: TripWIRED"
MissionSummary="Find the warehouse in Scorched Snake Canyon and return the WIRED device to Blake."
Objectives[0]=(ProgressMessage="Warehouse located:")
Objectives[1]=(ProgressMessage="WIRED device found:")
TurnInDescription="You got the WIRED device!  And all it cost you was a little sweat and a whole lotta bullets.  Now it's time for a robotic regime change."

[MainMissions.M_DLC4_TripWIRED_dummy MissionDefinition]
MissionDescription="The enigmatically named wireless WIRED device is the key to shutting down the Claptrap Revolution once and for all. Lower the bridge, storm Scorched Snake Canyon, and retrieve the device for Blake."
MissionGiver="Blake"
MissionName="OTCT, Phase Three: TripWIRED"
MissionSummary="Find the warehouse in Scorched Snake Canyon and return the WIRED device to Blake."
Objectives[0]=(ProgressMessage="Warehouse located:")
Objectives[1]=(ProgressMessage="WIRED device found:")
TurnInDescription="You got the WIRED device!  And all it cost you was a little sweat and a whole lotta bullets.  Now it's time for a robotic regime change."

[SideMissions.M_side_dlc4_OldSpicy MissionDefinition]
MissionDescription="Marcus knows what women like: musky odor! Go to Scorched Snake Canyon and find him 5 skag musk glands and some rakk hive ambergris so he can brew up a truly potent cologne."
MissionGiver="Marcus"
MissionName="Old Spicy"
MissionSummary="Collect skag musk and rakk hive ambergris in Scorched Snake Canyon for Marcus."
Objectives[0]=(ProgressMessage="Skag musk glands:")
Objectives[1]=(ProgressMessage="Rakk hive ambergris:")
TurnInDescription="That's all you need for a powerful aroma.  Guaranteed to always work on 60% of the ladies, at least half of the time."

